package Lesson1;

// Написать метод, которому в качестве параметра передается
// строка, обозначающая имя. Метод должен вывести в консоль
// сообщение «Привет, указанное_имя!».

public class Task4 {
    public static void main(String[] args) {
        String name = "Ян";
        System.out.println("Привет, " + name + "!");
    }
}
