package Lesson1;

// Написать метод, которому в качестве параметра
// передается целое число. Метод должен вернуть true,
// если число отрицательное.

public class Task3 {
    public static void main(String[] args) {
        int a = -1;
        System.out.println(a < 0);
    }
}
